# 시리즈 만들기

In [1]:
import pandas as pd

In [8]:
s = pd.Series(['banana', 24])

In [9]:
s

0    banana
1        24
dtype: object

In [15]:
s = pd.Series(['Chelsea', 'Chaeonny'], index=['Person', 'Who'])

In [16]:
s

Person     Chelsea
Who       Chaeonny
dtype: object

# 데이터프레임 만들기

In [10]:
d = pd.DataFrame(['banana', 24])

In [11]:
d

        0
0  banana
1      24

In [13]:
d = pd.DataFrame(['banana', 24, 25, 26])
d

        0
0  banana
1      24
2      25
3      26

In [17]:
aing = pd.DataFrame({
    'Name' : ['CW', 'SW', 'HS'], 
    'Occupation' : ['data analysis', 'developer', 'scientist'],
    'Born' : ['1995-10-21', '1991-06-06', '1993-09-25'],
    'Age' : [25, 29, 27]
})

In [18]:
aing

   Age        Born Name     Occupation
0   25  1995-10-21   CW  data analysis
1   29  1991-06-06   SW      developer
2   27  1993-09-25   HS      scientist

In [19]:
aing = pd.DataFrame(
    data = {
        'Name' : ['CW', 'SW', 'HS'], 
        'Occupation' : ['data analysis', 'developer', 'scientist'],
        'Born' : ['1995-10-21', '1991-06-06', '1993-09-25'],
        'Age' : [25, 29, 27]
    },
    index = ['CW', 'SW', 'HS'],
    columns = ['Occupation', 'Born', 'Age']
)

In [20]:
aing

       Occupation        Born  Age
CW  data analysis  1995-10-21   25
SW      developer  1991-06-06   29
HS      scientist  1993-09-25   27

# 데이터프레임에서 시리즈 선택하기

In [21]:
aing

       Occupation        Born  Age
CW  data analysis  1995-10-21   25
SW      developer  1991-06-06   29
HS      scientist  1993-09-25   27

In [22]:
a = aing['Occupation']
a

CW    data analysis
SW        developer
HS        scientist
Name: Occupation, dtype: object

In [24]:
first_row = aing.loc['CW']

In [25]:
first_row

Occupation    data analysis
Born             1995-10-21
Age                      25
Name: CW, dtype: object

In [26]:
second_row = aing.loc['SW']
second_row

Occupation     developer
Born          1991-06-06
Age                   29
Name: SW, dtype: object

# index, values, keys 사용하기

In [27]:
first_row.index

Index(['Occupation', 'Born', 'Age'], dtype='object')

In [28]:
first_row.values

array(['data analysis', '1995-10-21', 25], dtype=object)

In [29]:
first_row.keys()

Index(['Occupation', 'Born', 'Age'], dtype='object')

In [30]:
aing.columns

Index(['Occupation', 'Born', 'Age'], dtype='object')

In [33]:
first_row.index[2]

'Age'

In [34]:
first_row.index[0]

'Occupation'

# 시리즈의 mean, min, max, std 메서드 사용하기

In [35]:
ages = aing['Age']
ages

CW    25
SW    29
HS    27
Name: Age, dtype: int64

In [36]:
ages.mean()

27.0

In [37]:
ages.min()

25

In [38]:
ages.max()

29

In [45]:
ages.std()

2.0

In [48]:
ages.get_values()

array([25, 29, 27], dtype=int64)

In [50]:
ages.values

array([25, 29, 27], dtype=int64)

In [51]:
ages.median()

27.0

In [40]:
a =[1, 2, 3, 4, 5, 5, 6,7, 7,7, 7, 8]

In [44]:
a_mean = sum(a) / len(a)
a_mean

5.166666666666667

# 시리즈와 불린 추출 사용하기

In [60]:
scientists = pd.read_csv('../data/scientists.csv', sep=',')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [54]:
scientists.shape

(8, 5)

In [55]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [56]:
ages.mean()

59.125

In [57]:
ages.max()

90

In [58]:
ages.min()

37

In [59]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [61]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [64]:
print(ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

# 시리즈와 브로드캐스팅

In [65]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [66]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [67]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [68]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [70]:
pd.Series([1, 100])

0      1
1    100
dtype: int64

In [71]:
ages + pd.Series([1, 199])

0     38.0
1    260.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [72]:
rev_ages = ages.sort_index(ascending=False)

In [73]:
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [79]:
list(reversed(ages))

[77, 41, 45, 56, 66, 90, 61, 37]

In [74]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [75]:
ages = list(ages)
ages

[37, 61, 90, 66, 56, 45, 41, 77]

In [76]:
sorted(ages)

[37, 41, 45, 56, 61, 66, 77, 90]

In [80]:
sorted(ages, reverse=True)

[90, 77, 66, 61, 56, 45, 41, 37]

In [81]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [84]:
gender = ['M', 'M', 'F', 'F', 'M', 'F', 'M', 'F']

In [85]:
scientists['gender'] = gender
scientists

,Name,Born,Died,Age,Occupation,gender
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M
5,John Snow,1813-03-15,1858-06-16,45,Physician,F
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F

In [87]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [89]:
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [90]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 데이터프레임과 불린 추출

In [92]:
scientists

,Name,Born,Died,Age,Occupation,gender
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M
5,John Snow,1813-03-15,1858-06-16,45,Physician,F
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F

In [93]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation gender
1        William Gosset  1876-06-13  1937-10-16   61   Statistician      M
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse      F
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist      F
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician      F

In [94]:
scientists['Age'].mean()

59.125

In [95]:
scientists.loc[[True, True, False, True]]

                Name        Born        Died  Age    Occupation gender
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist      M
1     William Gosset  1876-06-13  1937-10-16   61  Statistician      M
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist      F

# 데이터프레임과 브로드캐스팅

In [98]:
scientists

,Name,Born,Died,Age,Occupation,gender
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M
5,John Snow,1813-03-15,1858-06-16,45,Physician,F
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F

In [97]:
scientists * 2

,Name,Born,Died,Age,Occupation,gender
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist,MM
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician,MM
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse,FF
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist,FF
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist,MM
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician,FF
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist,MM
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician,FF

# 열의 자료형 바꾸기와 새로운 열 추가하기

In [99]:
scientists['Born'].dtype

dtype('O')

In [100]:
scientists['Born']

0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [107]:
born_datetime =pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [108]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [109]:
scientists['Died']

0    1958-04-16
1    1937-10-16
2    1910-08-13
3    1934-07-04
4    1964-04-14
5    1858-06-16
6    1954-06-07
7    1855-02-23
Name: Died, dtype: object

In [110]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [111]:
scientists

,Name,Born,Died,Age,Occupation,gender
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M
5,John Snow,1813-03-15,1858-06-16,45,Physician,F
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F

In [112]:
scientists['born_datetime'] = born_datetime
scientists['died_datetime'] = died_datetime
scientists

,Name,Born,Died,Age,Occupation,gender,born_datetime,died_datetime
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,F,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F,1777-04-30,1855-02-23

In [113]:
scientists.shape

(8, 8)

In [114]:
scientists['age_days_dt'] = scientists['died_datetime'] - scientists['born_datetime']
scientists

,Name,Born,Died,Age,Occupation,gender,born_datetime,died_datetime,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,M,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,M,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,F,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,F,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,M,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,F,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,M,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,F,1777-04-30,1855-02-23,28422 days

# 시리즈, 데이터프레임의 데이터 섞어보기

In [116]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'gender', 'born_datetime',
       'died_datetime', 'age_days_dt'],
      dtype='object')

In [115]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [117]:
import random

In [118]:
random.seed(36)

In [119]:
random.shuffle(scientists['Age'])

C:\Users\user\Anaconda3\lib\random.py:275: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  x[i], x[j] = x[j], x[i]

In [120]:
scientists['Age']

0    61
1    56
2    66
3    77
4    90
5    41
6    37
7    45
Name: Age, dtype: int64

# 데이터프레임의 열 삭제하기

In [121]:
scientists_dropped = scientists.drop(['Age'], axis=1)

In [122]:
scientists_dropped

,Name,Born,Died,Occupation,gender,born_datetime,died_datetime,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,M,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,M,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,F,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,F,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,M,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,F,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,M,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,F,1777-04-30,1855-02-23,28422 days

In [124]:
scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'gender', 'born_datetime',
       'died_datetime', 'age_days_dt'],
      dtype='object')

In [126]:
scientists_dropped = scientists_dropped.drop(['gender'], axis=1)

In [127]:
scientists_dropped

,Name,Born,Died,Occupation,born_datetime,died_datetime,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [128]:
scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'born_datetime', 'died_datetime',
       'age_days_dt'],
      dtype='object')

In [131]:
print(len(scientists.columns))
print(len(scientists_dropped.columns))

9
7

# 피클 형식으로 저장하기

In [173]:
cd doit_pandas-master/output/

C:\Users\user\Desktop\skc&c_데이터분석역량테스트\doit_pandas-master\output

In [174]:
name = scientists['Name']

In [175]:
scientists['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [176]:
name.to_pickle('../output/scientists_name_practice.pickle')

In [177]:
scientists.to_pickle('../output/scientists_df_practice.pickle')

In [178]:
s = pd.read_pickle('../output/scientists_name_practice.pickle')

In [179]:
s

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

# CSV 불러오기

In [180]:
concat = pd.read_csv('../data/concat_1.csv')
concat

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [181]:
scientists_dropped

,Name,Born,Died,Occupation,born_datetime,died_datetime,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [182]:
scientists

,Name,Born,Died,Age,Occupation,gender,born_datetime,died_datetime,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,61,Chemist,M,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,M,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,F,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,F,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,M,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,41,Physician,F,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,M,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,45,Mathematician,F,1777-04-30,1855-02-23,28422 days

In [183]:
name

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [184]:
name.to_csv('../output/scientists_names_series_1.csv')

In [185]:
scientists.to_csv('../output/scientists_df_practice.tsv', sep='\t')

In [186]:
scientists_dropped.to_csv('../output/scientists_final_practice.csv')

In [187]:
sd = scientists_dropped.to_csv('../output/scientists_final_practice.csv')

In [192]:
scientists_final = pd.read_csv('../output/scientists_final_practice.csv')

In [193]:
scientists_final

,Unnamed: 0,Name,Born,Died,Occupation,born_datetime,died_datetime,age_days_dt
0,0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days 00:00:00.000000000
1,1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days 00:00:00.000000000
2,2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days 00:00:00.000000000
3,3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days 00:00:00.000000000
4,4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days 00:00:00.000000000
5,5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days 00:00:00.000000000
6,6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days 00:00:00.000000000
7,7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days 00:00:00.000000000